package data;

public enum CourseData  {
    BI_АНАЛИТИКА("BI-аналитика", "2023-02-28","Популярные курсы"),
    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы"),
    TEAM_LEAD("Team Lead", "2023-02-28","Популярные курсы"),
    СПЕЦИАЛИЗАЦИЯ_ADMINISTRATOR_LINUX("Специализация Administrator Linux", "2023-01-28","Специализации"),
    СПЕЦИАЛИЗАЦИЯ_СЕТЕВОЙ_ИНЖЕНЕР("Специализация сетевой инженер", "2023-02-28","Специализации");
//    BI_АНАЛИТИКА("BI-аналитика", "2023-02-28","Популярные курсы"),
//    BI_АНАЛИТИКА("BI-аналитика", "2023-02-28","Популярные курсы"),
//    BI_АНАЛИТИКА("BI-аналитика", "2023-02-28","Популярные курсы"),
//    BI_АНАЛИТИКА("BI-аналитика", "2023-02-28","Популярные курсы"),
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");
//    СИСТЕМНЫЙ_АНАЛИТИК_ADVANCED("Системный аналитик. Advanced", "2023-02-27","Популярные курсы");


    final String name;
    final String date;
    final String category;

    CourseData(String name, String date, String category) {
        this.name = name;
        this.date = date;
        this.category = category;
    }

    public String getName() {
        return name;
    }

    public String getDate() {
        return this.date;
    }

    public String getCategory() {
        return this.category;
    }
}
