#language: ru

Функционал: Выбор и фильтрация курсов

  Предыстория:
    * Открываем главную страницу через браузер "chrome"
    * Закрываем всплывающие окна

  Сценарий: Выбор курса по названию
    * В категории "Популярные курсы" выбираем "BI-аналитика"

  Сценарий: Выбор курса на ближайшую дату
    * Выбираем ближайший курс на дату "2023-03-29"

  Сценарий: Выбор последнего курса
    * Выбираем самый поздний курс

  Сценарий: Выбор самого дешевого курса
    * Выбираем самый дешевый курс

  Сценарий: Выбор самого дорогого курса
    * Выбираем самый дорогой курс