#language: ru

Функционал: Выбор и фильтрация курсов

  Предыстория:
    Пусть Открываем главную страницу через браузер "chrome"
    Тогда Закрываем всплывающие окна

  Сценарий: Выбор курса по названию
    Затем В категории "Популярные курсы" выбираем "BI-аналитика"

  Сценарий: Выбор курса на ближайшую дату
    Затем Выбираем ближайший курс на дату "2023-03-29"

  Сценарий: Выбор последнего курса
    Затем Выбираем самый поздний курс

  Сценарий: Выбор самого дешевого курса
    Затем Выбираем самый дешевый курс

  Сценарий: Выбор самого дорогого курса
    Затем Выбираем самый дорогой курс